Repository: Zhou-Joe/guitaAssistant
Catalog: ios-native/GuitarAssistant/Resources/Localizable.xcstrings
Source language: en
Languages: ja, zh

source: About
ja: について
zh: 关于

source: Add Measure
ja: 小節を追加
zh: 添加小节

# ai_config
source: AI Configuration
ja: AI 設定
zh: AI 配置

# ai_enable
source: Enable AI
ja: AI を有効化
zh: 启用 AI

# ai_endpoint
source: API Endpoint
ja: API エンドポイント
zh: API 端点

source: AI Features
ja: AI 機能
zh: AI 功能

# ai_key
source: API Key
ja: API キー
zh: API 密钥

# ai_model
source: Model
ja: モデル
zh: 模型

# ai_not_configured
source: AI is not configured. Please set it up in Settings first.
ja: AIが未設定です。先に設定してください。
zh: AI 未配置，请先在设置中配置。

# ai_response_invalid
source: AI returned an invalid response. Please retry.
ja: AI応答が無効です。再試行してください。
zh: AI 返回无效，请重试。

# ai_test_connection
source: Test Connection
ja: 接続テスト
zh: 测试连接

# ai_test_failed
source: Connection failed
ja: 接続失敗
zh: 连接失败

# ai_test_success
source: Connection successful
ja: 接続成功
zh: 连接成功

# ai_testing
source: Testing...
ja: テスト中...
zh: 测试中...

source: Almost there...
ja: もう少し...
zh: 快调准了...

# analysis_heatmap
source: Heatmap
ja: ヒートマップ
zh: 热力图

# analysis_timeline
source: Timeline
ja: タイムライン
zh: 时间轴

# analysis_title
source: Analysis
ja: 分析
zh: 分析

# analysis_waveform
source: Waveform
ja: 波形
zh: 波形

source: Analyze
ja: 分析
zh: 分析

# analyze_failed
source: Analysis failed. The file may be unsupported or contain no audio.
ja: 分析に失敗しました。ファイルが未対応か音声がありません。
zh: 分析失败。文件可能不受支持或无音频。

source: Analyzing...
ja: 分析中...
zh: 分析中...

source: Camera permission denied
ja: カメラ権限が拒否されました
zh: 相机权限被拒绝

# camera_unavailable
source: Camera is not ready yet
ja: カメラの準備ができていません
zh: 相机尚未就绪

source: Cancel
ja: キャンセル
zh: 取消

# chord_not_found
source: Custom chord
ja: カスタムコード
zh: 自定义和弦

source: Chords
ja: コード
zh: 和弦

source: Close
ja: 閉じる
zh: 关闭

source: Delete
ja: 削除
zh: 删除

source: Delete failed
ja: 削除に失敗
zh: 删除失败

source: Delete Note
ja: 音符を削除
zh: 删除音符

source: Edit
ja: 編集
zh: 编辑

# edit_fret
source: Fret %d — select new value or delete
ja: フレット %d — 新しい値を選択または削除
zh: 品位 %d — 选择新值或删除

source: Edit Tab
ja: TABを編集
zh: 编辑曲谱

source: Edited
ja: 編集済み
zh: 已编辑

# export_tab
source: Export
ja: エクスポート
zh: 导出

source: Favorites
ja: お気に入り
zh: 收藏

# file_load_failed
source: Failed to load file
ja: ファイルの読み込みに失敗
zh: 文件加载失败

source: File not found
ja: ファイルが見つかりません
zh: 文件不存在

# heatmap_title
source: Timing accuracy per beat
ja: 拍ごとの精度
zh: 每拍节奏精度

source: Image
ja: 画像
zh: 图片

# image_encode_failed
source: Failed to encode image
ja: 画像エンコードに失敗
zh: 图片编码失败

source: Import failed
ja: インポートに失敗
zh: 导入失败

source: Import Tab
ja: 楽譜をインポート
zh: 导入曲谱

source: In Tune!
ja: チューニング完了！
zh: 已调准！

source: Invalid URL
ja: URLが無効です
zh: URL 无效

source: Language
ja: 言語
zh: 语言

# language_hint
source: The new language will take effect after restarting the app.
ja: 新しい言語はアプリの再起動後に反映されます。
zh: 新语言将在重启应用后生效。

# language_hint_title
source: Language Changed
ja: 言語を変更しました
zh: 语言已切换

# legend_actual
source: Actually played
ja: 実際の演奏
zh: 实际演奏

# legend_expected
source: Expected beats
ja: 期待される拍
zh: 期望节拍

# measure_n
source: Measure %d
ja: 小節 %d
zh: 第 %d 小节

# measures_per_row
source: Measures/row
ja: 行あたり小節
zh: 每行小节

# method_ai
source: AI Only
ja: AIのみ
zh: 仅 AI

# method_cv
source: CV Only (offline)
ja: CVのみ（オフライン）
zh: 仅 CV（离线）

# method_hybrid
source: Hybrid (CV + AI, recommended)
ja: ハイブリッド（CV+AI、推奨）
zh: 混合（CV + AI，推荐）

source: Metronome
ja: メトロノーム
zh: 节拍器

# metronome_load_failed
source: Failed to load metronome sounds
ja: メトロノーム音の読み込みに失敗
zh: 节拍器音色加载失败

# mic_permission_denied
source: Microphone permission denied
ja: マイク権限が拒否されました
zh: 麦克风权限被拒绝

# mic_unavailable
source: Microphone unavailable
ja: マイクを使用できません
zh: 麦克风不可用

source: Mode
ja: モード
zh: 模式

# mode_annotate
source: Annotated
ja: 注釈
zh: 标注

# mode_audio
source: Audio
ja: オーディオ
zh: 音频

# mode_chords
source: Chords
ja: コード
zh: 和弦

# mode_measures
source: Measures
ja: 小節
zh: 小节

# mode_video
source: Video
ja: ビデオ
zh: 视频

# no_chords
source: No chords recognized
ja: コードが認識されませんでした
zh: 未识别到和弦

source: No data
ja: データなし
zh: 无数据

# no_measures
source: No measures recognized
ja: 小節が認識されませんでした
zh: 未识别到小节

# no_original_image
source: Original image unavailable
ja: 元画像がありません
zh: 原图不可用

# no_recordings
source: No recordings yet
ja: 録音がありません
zh: 还没有录音

# no_recordings_hint
source: Press record to capture your playing
ja: 録音ボタンで演奏を記録
zh: 按下录音按钮记录你的演奏

# no_tabs
source: No tabs yet
ja: 楽譜がありません
zh: 还没有曲谱

# no_tabs_hint
source: Import a PDF or image to get started
ja: PDFや画像をインポートして開始
zh: 导入 PDF 或图片曲谱开始使用

source: Notice
ja: お知らせ
zh: 提示

source: Open Settings
ja: 設定を開く
zh: 打开设置

source: Pause
ja: 一時停止
zh: 暂停

source: Playback failed
ja: 再生に失敗
zh: 播放失败

# recognition_confidence
source: Confidence: %d%%
ja: 信頼度：%d%%
zh: 置信度：%d%%

source: Recognition Failed
ja: 認識に失敗しました
zh: 识别失败

# recognizing_method
source: Recognizing with %@...
ja: %@で認識中...
zh: 正在用 %@ 识别...

# record_paused
source: Paused
ja: 一時停止中
zh: 已暂停

source: Recording
ja: 録音
zh: 录音

source: Recording & Analysis
ja: 録音・分析
zh: 录音与分析

# recording_save_failed
source: Recording could not be saved
ja: 録音を保存できませんでした
zh: 录制内容未能保存

source: Rename
ja: 名前変更
zh: 重命名

source: Retry
ja: 再試行
zh: 重试

# sample_tab2_title
source: Sample TAB (G-Em-C-D)
ja: サンプルTAB（G-Em-C-D）
zh: 示例曲谱（G-Em-C-D）

# sample_tab_title
source: Sample TAB (C-Am-F-G)
ja: サンプルTAB（C-Am-F-G）
zh: 示例曲谱（C-Am-F-G）

source: Save
ja: 保存
zh: 保存

source: Save failed
ja: 保存に失敗
zh: 保存失败

source: Saved
ja: 保存しました
zh: 已保存

source: Search
ja: 検索
zh: 搜索

source: Select Fret
ja: フレットを選択
zh: 选择品位

# select_method
source: Recognition Method
ja: 認識方式
zh: 识别方式

source: Settings
ja: 設定
zh: 设置

source: Share
ja: 共有
zh: 分享

# share_image
source: Share as Image
ja: 画像で共有
zh: 分享六线谱图片

# share_tab_text
source: Check out my guitar tab!
ja: ギターTAB譜をチェック！
zh: 看看我识别的吉他六线谱！

# share_text
source: My guitar recording: %@
ja: 私のギター演奏：%@
zh: 我的吉他演奏：%@

# share_text_tab
source: Share as Text
ja: テキストで共有
zh: 分享文本 TAB

source: Sound
ja: 音色
zh: 音色

# sound_classic
source: Classic
ja: クラシック
zh: 经典

# sound_cowbell
source: Cowbell
ja: カウベル
zh: 牛铃

# sound_digital
source: Digital
ja: デジタル
zh: 电子

# sound_hihat
source: Hi-Hat
ja: ハイハット
zh: 踩镲

# sound_woodblock
source: Woodblock
ja: 木魚
zh: 木鱼

source: Start
ja: 開始
zh: 开始

# stat_accuracy
source: Accuracy
ja: 精度
zh: 准确度

# stat_deviation
source: Avg Deviation
ja: 平均偏差
zh: 平均偏差

# stat_on_beat
source: On Beat
ja: オンビート
zh: 命中

source: Stop
ja: 停止
zh: 停止

# stop_save
source: Stop and Save
ja: 停止して保存
zh: 停止并保存

# string_n
source: String %@
ja: 第%@弦
zh: 第%@弦

# sub_cards
source: Cards
ja: カード
zh: 卡片

# sub_staff
source: Staff
ja: TAB譜
zh: 六线谱

source: Tap Start to begin
ja: 開始をタップ
zh: 点击开始调音

source: Target BPM
ja: 目標 BPM
zh: 目标 BPM

# target_format
source: Target: %@
ja: 目標: %@
zh: 目标: %@

source: Tempo Mode
ja: テンポモード
zh: 速度模式

# tempo_mode_gradual
source: Gradual
ja: 徐々に
zh: 渐快

# tempo_mode_interval
source: Interval
ja: インターバル
zh: 间歇

# tempo_mode_manual
source: Manual
ja: マニュアル
zh: 手动

# tempo_mode_step
source: Step
ja: ステップ
zh: 阶梯

source: Text TAB
ja: テキストTAB
zh: 文本 TAB

source: Time Signature
ja: 拍子
zh: 拍号

source: Title
ja: タイトル
zh: 标题

# too_flat_tighten
source: Too flat - tighten string
ja: 低すぎ - 弦を張る
zh: 偏低 - 拧紧琴弦

# too_sharp_loosen
source: Too sharp - loosen string
ja: 高すぎ - 弦を緩める
zh: 偏高 - 放松琴弦

source: Tuner
ja: チューナー
zh: 调音器

source: Video preview required
ja: ビデオプレビューが必要です
zh: 需要视频预览

source: OK
zh: 好
